app/controllers/assets_controller.rb

SELECT * FROM "kinds" WHERE ("kinds"."id" IN (691081111,833631093))
SELECT * FROM "manufacturers" WHERE ("manufacturers"."id" IN (778622964,506965603))
SELECT * FROM "models" WHERE ("models"."id" IN (90487597,515471361))
SELECT * FROM "users" WHERE ("users"."id" = 236175557)
---
  def index
    @assets = Asset.find(:all, :include => [:user, {:model => [:manufacturer, :kind]}])

SELECT * FROM "assets" WHERE ("assets"."id" = 497615788)
---
  def show
    @asset = Asset.find(params[:id])

SELECT * FROM "assets" WHERE ("assets"."id" = 497615788)
---
  def edit
    @asset = Asset.find(params[:id])

INSERT INTO "assets" ("serial", "created_at", "notes", "updated_at", "user_id", "location_id", "model_id") VALUES(NULL, '2009-01-13 07:34:15.332109', NULL, '2009-01-13 07:34:15.332109', 236175557, 344860588, 515471361) RETURNING "id"
---
  def create
    @asset = Asset.new(params[:asset])

    respond_to do |format|
      if @asset.save

SELECT * FROM "assets" WHERE ("assets"."id" = 497615788)
UPDATE "assets" SET "updated_at" = '2009-01-13 01:04:36.663409', "serial" = E'X89N3289328UCD33' WHERE "id" = 949993248
---
  def update
    @asset = Asset.find(params[:id])

    respond_to do |format|
      if @asset.update_attributes(params[:asset])

SELECT * FROM "assets" WHERE ("assets"."id" = 497615788)
DELETE FROM "assets" WHERE "id" = 497615788
---
  def destroy
    @asset = Asset.find(params[:id])
    @asset.destroy