app/controllers/examples_controller.rb

INSERT INTO "examples" ("created_at", "updated_at") VALUES('2009-01-13 06:43:57.189694', '2009-01-13 06:43:57.189694') RETURNING "id"
---
  def create
    @example = Example.new(params[:example])

    respond_to do |format|
      if @example.save