app/controllers/kinds_controller.rb

  def show
    @kind = Kind.find(params[:id])
---
SELECT * FROM "kinds" WHERE ("kinds"."id" = 691081111)

  def edit
    @kind = Kind.find(params[:id])
---
SELECT * FROM "kinds" WHERE ("kinds"."id" = 691081111)

  def create
    @kind = Kind.new(params[:kind])

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("name", "created_at", "updated_at") VALUES(E'Phone', '2009-01-13 07:27:34.313738', '2009-01-13 07:27:34.313738') RETURNING "id"

  def update
    @kind = Kind.find(params[:id])
---
SELECT * FROM "kinds" WHERE ("kinds"."id" = 691081111)

  def destroy
    @kind = Kind.find(params[:id])
    @kind.destroy
---
SELECT * FROM "kinds" WHERE ("kinds"."id" = 691081111)
DELETE FROM "kinds" WHERE "id" = 691081111