app/controllers/locations_controller.rb

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES(E'Home', '2009-01-13 07:23:01.627830', '2009-01-13 07:23:01.627830') RETURNING "id"

  def update
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)
DELETE FROM "locations" WHERE "id" = 344860588