app/controllers/manufacturers_controller.rb

  def show
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT * FROM "manufacturers" WHERE ("manufacturers"."id" = 778622964)

  def edit
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT * FROM "manufacturers" WHERE ("manufacturers"."id" = 778622964)

  def create
    @manufacturer = Manufacturer.new(params[:manufacturer])

    respond_to do |format|
      if @manufacturer.save
---
INSERT INTO "manufacturers" ("name", "created_at", "updated_at") VALUES(E'Microsoft', '2009-01-13 07:24:06.992065', '2009-01-13 07:24:06.992065') RETURNING "id"

  def update
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT * FROM "manufacturers" WHERE ("manufacturers"."id" = 778622964)

  def destroy
    @manufacturer = Manufacturer.find(params[:id])
    @manufacturer.destroy
---
SELECT * FROM "manufacturers" WHERE ("manufacturers"."id" = 778622964)
DELETE FROM "manufacturers" WHERE "id" = 778622964