app/controllers/models_controller.rb

SELECT * FROM "models" WHERE ("models"."id" = 515471361)
---
  def show
    @model = Model.find(params[:id])

SELECT * FROM "models" WHERE ("models"."id" = 515471361)
---
  def edit
    @model = Model.find(params[:id])

INSERT INTO "models" ("name", "manufacturer_id", "created_at", "updated_at", "kind_id") VALUES(E'Ninjitsu 5000', 778622964, '2009-01-13 07:26:56.518640', '2009-01-13 07:26:56.518640', 691081111) RETURNING "id"
---
  def create
    @model = Model.new(params[:model])

    respond_to do |format|
      if @model.save

SELECT * FROM "models" WHERE ("models"."id" = 515471361)
---
  def update
    @model = Model.find(params[:id])

SELECT * FROM "models" WHERE ("models"."id" = 515471361)
DELETE FROM "models" WHERE "id" = 515471361
---
  def destroy
    @model = Model.find(params[:id])
    @model.destroy