app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "login", "email") VALUES('2009-01-13 07:21:30.720612', '2009-01-13 07:21:30.720612', E'charlie', E'charlie@example.com') RETURNING "id"

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 236175557)
UPDATE "users" SET "updated_at" = '2009-01-13 01:08:27.588267', "login" = E'a-dogg' WHERE "id" = 236175557